abelykh0/stm32h750-z80emu/Main/screen/vga.c
#include "stm32h7xx_hal.h"
#include "ltdc.h"

#include "vga.h"
#include "config.h"

uint32_t L8Clut[256];

static uint32_t Convert2BitColor(uint32_t color)
{
	switch (color)
	{
	case 0x00:
		return 0x00;
	case 0x01:
		return 0x55;
	case 0x02:
		return 0xAA;
	default:
		return 0xFF;
	}
}

void PrepareClut()
{
	for (uint32_t i = 0; i < 256; i++)
	{
		// xxBBGGRR > ARBG

		// R
		uint32_t paletteR = i & 0x0003;
		uint32_t r = Convert2BitColor(paletteR) << 16;

		// G
		uint32_t paletteG = (i & 0x000C) >> 2;
		uint32_t g = Convert2BitColor(paletteG) << 8;

		// B
		uint32_t paletteB = (i & 0x0030) >> 4;
		uint32_t b = Convert2BitColor(paletteB);

		L8Clut[i] = 0xff000000 | r | g | b;
	}
}

void LtdcInit()
{
	LTDC_LayerCfgTypeDef pLayerCfg = {0};
	hltdc.Instance = LTDC;

	LTDC_InitTypeDef* init = &hltdc.Init;
	init->DEPolarity = LTDC_DEPOLARITY_AL;
	init->PCPolarity = LTDC_PCPOLARITY_IIPC;
	init->Backcolor.Blue = 0;
	init->Backcolor.Green = 0;
	init->Backcolor.Red = 0;

	// Horizontal
	init->HSPolarity = VIDEO_MODE_H_POLARITY;
	init->HorizontalSync = VIDEO_MODE_H_SYNC - 1;
	init->AccumulatedHBP = init->HorizontalSync + VIDEO_MODE_H_BACKPORCH;
	init->AccumulatedActiveW = init->AccumulatedHBP + VIDEO_MODE_H_WIDTH;
	init->TotalWidth = init->AccumulatedActiveW + VIDEO_MODE_H_FRONTPORCH;

	// Vertical
	init->VSPolarity = VIDEO_MODE_V_POLARITY;
	init->VerticalSync = VIDEO_MODE_V_SYNC - 1;
	init->AccumulatedVBP = init->VerticalSync + VIDEO_MODE_V_BACKPORCH;
	init->AccumulatedActiveH = init->AccumulatedVBP + VIDEO_MODE_V_HEIGHT;
	init->TotalHeigh = init->AccumulatedActiveH + VIDEO_MODE_V_FRONTPORCH;

	if (HAL_LTDC_Init(&hltdc) != HAL_OK)
	{
		Error_Handler();
	}

	pLayerCfg.PixelFormat = LTDC_PIXEL_FORMAT_L8;
	pLayerCfg.Alpha = 0xff;
	pLayerCfg.Alpha0 = 0xff;
	pLayerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
	pLayerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;

	uint32_t argb = L8Clut[BORDER_COLOR];
	pLayerCfg.Backcolor.Blue = argb & 0xFF;
	pLayerCfg.Backcolor.Green = (argb >> 8) & 0xFF;
	pLayerCfg.Backcolor.Red = (argb >> 16) & 0xFF;

	pLayerCfg.WindowX0 = (VIDEO_MODE_H_WIDTH - H_SIZE) / 2;
	pLayerCfg.WindowX1 = pLayerCfg.WindowX0 + H_SIZE - 1;
	pLayerCfg.WindowY0 = (VIDEO_MODE_V_HEIGHT - V_SIZE) / 2;
	pLayerCfg.WindowY1 = pLayerCfg.WindowY0 + V_SIZE - 1;
	pLayerCfg.ImageWidth = H_SIZE;
	pLayerCfg.ImageHeight = V_SIZE;
	pLayerCfg.FBStartAdress = (uint32_t)VideoRam;

	if (HAL_LTDC_ConfigLayer(&hltdc, &pLayerCfg, 0) != HAL_OK)
	{
		Error_Handler();
	}

	HAL_LTDC_MspInit(&hltdc);

	// Pixel clock
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};
	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
	PeriphClkInitStruct.PLL3.PLL3P = 2;
	PeriphClkInitStruct.PLL3.PLL3Q = 2;
	PeriphClkInitStruct.PLL3.PLL3FRACN = 0;
	PeriphClkInitStruct.PLL3.PLL3VCOSEL = RCC_PLL3VCOWIDE;

	PeriphClkInitStruct.PLL3.PLL3M = VIDEO_MODE_PLL3M;
	PeriphClkInitStruct.PLL3.PLL3N = VIDEO_MODE_PLL3N;
	PeriphClkInitStruct.PLL3.PLL3R = VIDEO_MODE_PLL3R;
	PeriphClkInitStruct.PLL3.PLL3RGE = VIDEO_MODE_PLL3RGE;

	if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
	{
		Error_Handler();
	}

	HAL_LTDC_ConfigCLUT(&hltdc, L8Clut, 256, LTDC_LAYER_1);
	HAL_LTDC_EnableCLUT(&hltdc, LTDC_LAYER_1);
}
